Repository: alnayeem/tasktrakr
Catalog: lib/l10n/app_*.arb
Languages: bn, ur, uz

# continueButton
source: Continue
bn: শুরু করুন
ur: جاری رکھیں
uz: Davom etish

source: Get Started
bn: শুরু করুন
ur: شروع کریں
uz: Boshlash

source: Welcome
bn: স্বাগতম
ur: خوش آمدید
uz: Xush kelibsiz

# welcomeDescription
source: Turn your goals into achievable daily tasks with AI
bn: AI এর সাহায্যে আপনার লক্ষ্যগুলোকে দৈনিক অর্জনযোগ্য কাজে রূপান্তর করুন
ur: AI کی مدد سے اپنے مقاصد کو قابل حصول روزانہ کاموں میں بدلیں
uz: AI yordamida maqsadlaringizni kundalik erishish mumkin bo'lgan vazifalarga aylantiring

# featureSetGoals
source: Set goals in your own words
bn: নিজের কথায় লক্ষ্য নির্ধারণ করুন
ur: اپنے الفاظ میں مقاصد طے کریں
uz: Maqsadlaringizni o'z so'zlaringiz bilan belgilang

# featureAIPlan
source: AI creates your daily plan
bn: AI আপনার দৈনিক পরিকল্পনা তৈরি করে
ur: AI آپ کا روزانہ منصوبہ بناتا ہے
uz: AI kundalik rejangizni tuzadi

# featureTrackProgress
source: Track progress every day
bn: প্রতিদিন অগ্রগতি ট্র্যাক করুন
ur: ہر روز پیشرفت ٹریک کریں
uz: Har kuni rivojlanishingizni kuzating

# featureRamadanMode
source: Special Ramadan mode
bn: বিশেষ রমজান মোড
ur: خصوصی رمضان موڈ
uz: Maxsus Ramazon rejimi

source: Today's Tasks
bn: আজকের কাজ
ur: آج کے کام
uz: Bugungi vazifalar

source: My Goals
bn: আমার লক্ষ্য
ur: میرے مقاصد
uz: Maqsadlarim

source: New Goal
bn: নতুন লক্ষ্য
ur: نیا مقصد
uz: Yangi maqsad

source: Add Goal
bn: লক্ষ্য যোগ করুন
ur: مقصد شامل کریں
uz: Maqsad qo'shish

# whatToAchieve
source: What do you want to achieve?
bn: আপনি কী অর্জন করতে চান?
ur: آپ کیا حاصل کرنا چاہتے ہیں؟
uz: Nimaga erishmoqchisiz?

# goalHint
source: Example: I want to complete reading the Quran this Ramadan...
bn: উদাহরণ: এই রমজানে কুরআন খতম করতে চাই...
ur: مثال: میں اس رمضان میں قرآن ختم کرنا چاہتا ہوں...
uz: Misol: Ushbu Ramazonda Qur'onni xatm qilmoqchiman...

source: Duration
bn: সময়কাল
ur: مدت
uz: Davomiyligi

source: Category (optional)
bn: ক্যাটাগরি (ঐচ্ছিক)
ur: زمرہ (اختیاری)
uz: Kategoriya (ixtiyoriy)

source: Generate Plan
bn: পরিকল্পনা তৈরি করুন
ur: منصوبہ بنائیں
uz: Reja tuzish

# aiWillCreate
source: AI will create a personalized daily plan for you
bn: AI আপনার জন্য একটি ব্যক্তিগত দৈনিক পরিকল্পনা তৈরি করবে
ur: AI آپ کے لیے ایک ذاتی روزانہ منصوبہ بنائے گا
uz: AI siz uchun shaxsiy kundalik reja tuzadi

# analyzingGoal
source: Analyzing your goal...
bn: আপনার লক্ষ্য বিশ্লেষণ করা হচ্ছে...
ur: آپ کے مقصد کا تجزیہ...
uz: Maqsadingiz tahlil qilinmoqda...

# creatingPlan
source: Creating your personalized plan...
bn: আপনার ব্যক্তিগত পরিকল্পনা তৈরি হচ্ছে...
ur: آپ کا ذاتی منصوبہ بن رہا ہے...
uz: Shaxsiy rejangiz tuzilmoqda...

# distributingTasks
source: Distributing tasks across {days} days...
bn: {days} দিনে কাজ বিতরণ করা হচ্ছে...
ur: {days} دنوں میں کام تقسیم ہو رہے ہیں...
uz: Vazifalar {days} kunga taqsimlanmoqda...

source: Adding rest days...
bn: বিশ্রামের দিন যোগ করা হচ্ছে...
ur: آرام کے دن شامل ہو رہے ہیں...
uz: Dam olish kunlari qo'shilmoqda...

source: Final touches...
bn: চূড়ান্ত স্পর্শ...
ur: آخری لمحات...
uz: Yakuniy tegishlar...

# creatingDailyTasks
source: Creating {days} daily tasks
bn: {days}টি দৈনিক কাজ তৈরি হচ্ছে
ur: {days} روزانہ کام بن رہے ہیں
uz: {days} kunlik vazifa tuzilmoqda

source: Your goal:
bn: আপনার লক্ষ্য:
ur: آپ کا مقصد:
uz: Maqsadingiz:

source: Cancel
bn: বাতিল
ur: منسوخ
uz: Bekor qilish

# daysOfDays
source: {completed} of {total} days
bn: {total} দিনের মধ্যে {completed} দিন
ur: {total} میں سے {completed} دن
uz: {total} kundan {completed} kun

source: Complete
bn: সম্পূর্ণ
ur: مکمل
uz: Tugallandi

source: Current Streak
bn: বর্তমান ধারা
ur: موجودہ سلسلہ
uz: Joriy ketma-ketlik

source: Best Streak
bn: সেরা ধারা
ur: بہترین سلسلہ
uz: Eng yaxshi ketma-ketlik

source: Phase of Mercy
bn: রহমতের পর্ব
ur: رحمت کا مرحلہ
uz: Rahmat bosqichi

source: Phase of Forgiveness
bn: ক্ষমার পর্ব
ur: مغفرت کا مرحلہ
uz: Mag'firat bosqichi

source: Phase of Salvation
bn: মুক্তির পর্ব
ur: نجات کا مرحلہ
uz: Najot bosqichi

# daysRange
source: Days {start}-{end}
bn: দিন {start}-{end}
ur: دن {start}-{end}
uz: Kunlar {start}-{end}

source: Qadr nights soon
bn: লাইলাতুল কদর আসছে
ur: شب قدر قریب ہے
uz: Qadr kechalari yaqin

source: Today
bn: আজ
ur: آج
uz: Bugun

# todayDay
source: Today - Day {day}
bn: আজ - দিন {day}
ur: آج - دن {day}
uz: Bugun - {day}-kun

source: Upcoming
bn: আসন্ন
ur: آنے والا
uz: Kelayotgan

source: Completed
bn: সম্পন্ন
ur: مکمل
uz: Tugallangan

source: Edit Goal
bn: লক্ষ্য সম্পাদনা
ur: مقصد میں ترمیم
uz: Maqsadni tahrirlash

source: Regenerate Plan
bn: পরিকল্পনা পুনরায় তৈরি
ur: منصوبہ دوبارہ بنائیں
uz: Rejani qayta tuzish

source: Delete Goal
bn: লক্ষ্য মুছুন
ur: مقصد حذف کریں
uz: Maqsadni o'chirish

source: Settings
bn: সেটিংস
ur: ترتیبات
uz: Sozlamalar

source: Language
bn: ভাষা
ur: زبان
uz: Til

source: Select Language
bn: ভাষা নির্বাচন করুন
ur: زبان منتخب کریں
uz: Tilni tanlang

source: Appearance
bn: চেহারা
ur: ظاہری شکل
uz: Ko'rinish

source: Theme
bn: থিম
ur: تھیم
uz: Mavzu

source: Select Theme
bn: থিম নির্বাচন করুন
ur: تھیم منتخب کریں
uz: Mavzuni tanlang

source: System Default
bn: সিস্টেম ডিফল্ট
ur: سسٹم ڈیفالٹ
uz: Tizim standarti

source: Light
bn: লাইট
ur: روشن
uz: Yorug'

source: Dark
bn: ডার্ক
ur: تاریک
uz: Qorong'u

source: About
bn: সম্পর্কে
ur: کے بارے میں
uz: Haqida

source: About TaskTrakr
bn: TaskTrakr সম্পর্কে
ur: TaskTrakr کے بارے میں
uz: TaskTrakr haqida

source: Privacy Policy
bn: গোপনীয়তা নীতি
ur: رازداری کی پالیسی
uz: Maxfiylik siyosati

source: Help & Support
bn: সাহায্য ও সহায়তা
ur: مدد اور سپورٹ
uz: Yordam va qo'llab-quvvatlash

# dataStaysPrivate
source: Your data stays private
bn: আপনার ডেটা ব্যক্তিগত থাকে
ur: آپ کا ڈیٹا نجی رہتا ہے
uz: Ma'lumotlaringiz maxfiy qoladi

# dataPrivacyDescription
source: All your data is stored locally on your device. We don't collect any personal information.
bn: আপনার সমস্ত ডেটা আপনার ডিভাইসে স্থানীয়ভাবে সংরক্ষিত। আমরা কোনো ব্যক্তিগত তথ্য সংগ্রহ করি না।
ur: آپ کا تمام ڈیٹا آپ کے آلے پر مقامی طور پر محفوظ ہے۔ ہم کوئی ذاتی معلومات جمع نہیں کرتے۔
uz: Barcha ma'lumotlaringiz qurilmangizda mahalliy saqlanadi. Biz hech qanday shaxsiy ma'lumot to'plamaymiz.

# aboutDescription
source: AI-powered goal and habit builder.
bn: AI-চালিত লক্ষ্য ও অভ্যাস নির্মাতা।
ur: AI سے چلنے والا مقصد اور عادت بنانے والا۔
uz: AI yordamida maqsad va odat yaratuvchisi.

# version
source: Version {version}
bn: সংস্করণ {version}
ur: ورژن {version}
uz: Versiya {version}

source: OK
bn: ঠিক আছে
ur: ٹھیک ہے

# days7
source: 7 days
bn: ৭ দিন
ur: 7 دن
uz: 7 kun

# days14
source: 14 days
bn: ১৪ দিন
ur: 14 دن
uz: 14 kun

# days21
source: 21 days
bn: ২১ দিন
ur: 21 دن
uz: 21 kun

# days30
source: 30 days
bn: ৩০ দিন
ur: 30 دن
uz: 30 kun

# days60
source: 60 days
bn: ৬০ দিন
ur: 60 دن
uz: 60 kun

# days90
source: 90 days
bn: ৯০ দিন
ur: 90 دن
uz: 90 kun

# categoryFitness
source: Fitness
bn: ফিটনেস
ur: فٹنس
uz: Fitnes

# categoryLearning
source: Learning
bn: শিক্ষা
ur: سیکھنا
uz: O'rganish

# categoryCreative
source: Creative
bn: সৃজনশীল
ur: تخلیقی
uz: Ijodiy

# categoryWellness
source: Wellness
bn: সুস্থতা
ur: تندرستی
uz: Salomatlik

# categoryFinancial
source: Financial
bn: আর্থিক
ur: مالی
uz: Moliyaviy

# categoryRamadan
source: Ramadan
bn: রমজান
ur: رمضان
uz: Ramazon

# categoryOther
source: Other
bn: অন্যান্য
ur: دیگر
uz: Boshqa

# chooseLanguage
source: Choose your language
bn: আপনার ভাষা নির্বাচন করুন
ur: اپنی زبان منتخب کریں
uz: Tilingizni tanlang
